[
    {
        "eng": "at",
        "vi": "tại, ở",
        "mean": "dùng cho các vị trí cụ thể hoặc địa điểm có giới hạn nhỏ, không cần mô tả không gian xung quanh.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "at home. at school. at the bus stop",
        "example_vi": "ở nhà (chỉ nhà là một địa điểm cụ thể). ở trường (chỉ một khu vực cụ thể là trường học). tại trạm xe buýt"
    },
    {
        "eng": "in",
        "vi": "trong, ở",
        "mean": "thường dùng để mô tả một nơi có không gian bao quanh như phòng, thành phố, hoặc quốc gia.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "in the park. in a country. in the room",
        "example_vi": "trong công viên (khu vực rộng có không gian xung quanh). trong một quốc gia (vùng đất lớn). trong phòng (không gian bao quanh bởi bốn bức tường)"
    },
    {
        "eng": "on",
        "vi": "trên, ở trên",
        "mean": "chỉ vị trí khi một vật nằm hoặc tiếp xúc với bề mặt của một thứ khác.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "on the table. on the wall. on the floor",
        "example_vi": "trên bàn (vật đặt trên bề mặt bàn). trên tường (trên bề mặt của tường). trên sàn nhà"
    },
    {
        "eng": "above",
        "vi": "ở trên, cao hơn",
        "mean": "dùng khi một vật ở vị trí cao hơn, không chạm hoặc tiếp xúc với bề mặt của vật bên dưới.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "The clock is above the door. Birds fly above the trees.",
        "example_vi": "Đồng hồ ở trên cửa. Chim bay ở trên cây."
    },
    {
        "eng": "below",
        "vi": "ở dưới, thấp hơn",
        "mean": "ngược lại với Above, chỉ vị trí thấp hơn một thứ khác.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "The temperature is below zero. The fish are swimming below the surface.",
        "example_vi": "Nhiệt độ dưới 0 độ. Cá đang bơi dưới bề mặt nước."
    },
    {
        "eng": "beside",
        "vi": "bên cạnh",
        "mean": "dùng khi một vật hoặc người ở sát bên một vật hoặc người khác.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "She sat beside her friend. The lamp is beside the bed.",
        "example_vi": "Cô ấy ngồi bên cạnh bạn của mình. Đèn nằm cạnh giường."
    },
    {
        "eng": "between",
        "vi": "giữa",
        "mean": "dùng khi một vật hoặc người ở vị trí nằm giữa hai đối tượng.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "He is standing between his parents. The letter is between the books.",
        "example_vi": "Anh ấy đứng giữa bố mẹ. Lá thư nằm giữa các cuốn sách (giữa hai cuốn sách)."
    },
    {
        "eng": "among",
        "vi": "trong số",
        "mean": "dùng khi một vật hoặc người ở trong tập hợp của nhiều đối tượng khác.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "She found her friend among the crowd. There is one red apple among the green ones.",
        "example_vi": "Cô ấy tìm thấy bạn mình trong đám đông. Có một quả táo đỏ trong số những quả táo xanh."
    },
    {
        "eng": "near",
        "vi": "gần",
        "mean": "dùng khi một vật hoặc người ở vị trí gần một đối tượng khác.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "The school is near the hospital. He lives near the beach",
        "example_vi": "Trường học gần bệnh viện.  Anh ấy sống gần biển."
    },
    {
        "eng": "inside",
        "vi": "bên trong",
        "mean": "chỉ vị trí bên trong một không gian khép kín hoặc bao quanh.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "The cat is inside the box. Please wait inside the room.",
        "example_vi": "Con mèo ở trong hộp. Hãy chờ ở trong phòng."
    },
    {
        "eng": "outside",
        "vi": "bên ngoài",
        "mean": "chỉ vị trí bên ngoài một không gian khép kín hoặc tòa nhà.",
        "type": "giới từ chỉ vị trí và nơi chốn",
        "example_eng": "The dog is outside the house. They are playing outside.",
        "example_vi": "Con chó ở bên ngoài nhà. Họ đang chơi ở bên ngoài."
    },
    {
        "eng": "at",
        "vi": "vào lúc",
        "mean": "được sử dụng khi nói đến thời điểm chính xác hoặc một khoảng thời gian ngắn.",
        "type": "giới từ chỉ thời gian",
        "example_eng": "at 3 PM. at night. at noon",
        "example_vi": "vào lúc 3 giờ chiều. vào ban đêm. vào giữa trưa"
    },
    {
        "eng": "in",
        "vi": "vào, trong",
        "mean": "được dùng để nói về các khoảng thời gian dài hoặc rộng hơn, như tháng, năm, mùa, hoặc các buổi trong ngày.",
        "type": "giới từ chỉ thời gian",
        "example_eng": "in January. in 2022. in winter. in the morning",
        "example_vi": "vào tháng Giêng. vào năm 2022. vào mùa đông. vào buổi sáng"
    },
    {
        "eng": "on",
        "vi": "vào ngày",
        "mean": "được dùng khi nói đến các ngày cụ thể hoặc ngày trong tuần.",
        "type": "giới từ chỉ thời gian",
        "example_eng": "on Monday. on July 4th. on my birthday",
        "example_vi": "vào thứ Hai. vào ngày 4 tháng 7. vào sinh nhật của tôi"
    },
    {
        "eng": "before",
        "vi": "trước",
        "mean": "dùng để nói về một sự kiện xảy ra trước một thời điểm hoặc sự kiện khác",
        "type": "giới từ chỉ thời gian",
        "example_eng": "before 9 AM. before the meeting",
        "example_vi": "trước 9 giờ sáng. trước cuộc họp"
    },
    {
        "eng": "after",
        "vi": "sau",
        "mean": "chỉ một sự kiện xảy ra sau một thời điểm hoặc sự kiện khác.",
        "type": "giới từ chỉ thời gian",
        "example_eng": "after lunch. after the show",
        "example_vi": "sau bữa trưa. sau buổi biểu diễn"
    },
    {
        "eng": "during",
        "vi": "trong suốt",
        "mean": "dùng để diễn tả một sự việc kéo dài trong suốt khoảng thời gian của một sự kiện hoặc thời kỳ.",
        "type": "giới từ chỉ thời gian",
        "example_eng": "during the meeting. during summer",
        "example_vi": "trong suốt cuộc họp. trong suốt mùa hè"
    },
    {
        "eng": "since",
        "vi": "từ lúc",
        "mean": "dùng khi nói về thời điểm bắt đầu của một hành động hoặc sự kiện vẫn tiếp diễn cho đến hiện tại.",
        "type": "giới từ chỉ thời gian",
        "example_eng": "since 1990. since this morning",
        "example_vi": "từ năm 1990. từ sáng nay"
    },
    {
        "eng": "until",
        "vi": "cho đến khi",
        "mean": "dùng để diễn tả sự việc kéo dài đến một thời điểm nhất định rồi kết thúc",
        "type": "giới từ chỉ thời gian",
        "example_eng": "until midnight. until Friday",
        "example_vi": "cho đến nửa đêm. cho đến thứ Sáu"
    },
    {
        "eng": "for",
        "vi": "trong khoảng",
        "mean": "dùng để chỉ một khoảng thời gian kéo dài bao lâu.",
        "type": "giới từ chỉ thời gian",
        "example_eng": "for 2 hours. for a week",
        "example_vi": "trong 2 giờ. trong một tuần"
    },
    {
        "eng": "for",
        "vi": "vì, cho",
        "mean": "được dùng khi chỉ mục đích của một hành động hoặc đối tượng nhận.",
        "type": "giới từ chỉ mục đích và nguyên nhân",
        "example_eng": "for you. for lunch. a gift for her",
        "example_vi": "cho bạn (người nhận là bạn). vì bữa trưa (mục đích là để dùng trong bữa trưa). một món quà cho cô ấy"
    },
    {
        "eng": "of",
        "vi": "của",
        "mean": "chỉ sự sở hữu, nguồn gốc, hoặc quan hệ giữa hai đối tượng.",
        "type": "giới từ chỉ mục đích và nguyên nhân",
        "example_eng": "the color of the sky. a friend of mine. the capital of France",
        "example_vi": "màu sắc của bầu trời (màu sắc thuộc về bầu trời). một người bạn của tôi. thủ đô của nước Pháp"
    },
    {
        "eng": "with",
        "vi": "với",
        "mean": "diễn tả sự đồng hành với một người, hoặc dùng một công cụ, phương tiện để thực hiện hành động.",
        "type": "giới từ chỉ mục đích và nguyên nhân",
        "example_eng": "with friends. with a knife. with joy",
        "example_vi": "cùng với bạn bè. bằng một con dao (dùng dao như công cụ). với niềm vui"
    },
    {
        "eng": "about",
        "vi": "về, liên quan đến",
        "mean": "dùng để nói về một chủ đề hoặc điều liên quan đến sự việc, sự vật.",
        "type": "giới từ chỉ mục đích và nguyên nhân",
        "example_eng": "a book about history. talking about the weather. curious about science",
        "example_vi": "một cuốn sách về lịch sử. nói về thời tiết. tò mò về khoa học"
    },
    {
        "eng": "by",
        "vi": "bởi, bằng cách",
        "mean": "có thể diễn tả người thực hiện hành động hoặc phương tiện, cách thức mà hành động được thực hiện.",
        "type": "giới từ chỉ mục đích và nguyên nhân",
        "example_eng": "by bus. by hand. a painting by Van Gogh",
        "example_vi": "bằng xe buýt (phương tiện là xe buýt). bằng tay (thực hiện bằng tay). một bức tranh của Van Gogh (do Van Gogh thực hiện)"
    },
    {
        "eng": "to",
        "vi": "đến",
        "mean": "dùng khi chỉ hướng đến một nơi hoặc đích đến cụ thể.",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "go to school. send it to me. travel to Paris",
        "example_vi": "đi đến trường. gửi nó cho tôi. đi du lịch đến Paris"
    },
    {
        "eng": "from",
        "vi": "từ",
        "mean": "chỉ điểm xuất phát hoặc nguồn gốc của một người, vật hoặc hành động.",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "from Vietnam. a gift from my friend. walk from home",
        "example_vi": "từ Việt Nam. món quà từ bạn của tôi. đi bộ từ nhà"
    },
    {
        "eng": "into",
        "vi": "vào trong",
        "mean": "chỉ sự di chuyển từ bên ngoài vào bên trong của một không gian.",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "walk into the room. put it into the box. jump into the pool",
        "example_vi": "bước vào phòng. đặt nó vào trong hộp. nhảy vào bể bơi"
    },
    {
        "eng": "out of",
        "vi": "ra khỏi",
        "mean": "ngược lại với Into, chỉ sự di chuyển từ bên trong ra bên ngoài của một không gian",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "go out of the house. take it out of the bag. get out of the car",
        "example_vi": "đi ra khỏi nhà. lấy nó ra khỏi túi. ra khỏi xe"
    },
    {
        "eng": "towards",
        "vi": "hướng tới",
        "mean": "chỉ hướng di chuyển đến gần một nơi hoặc một người, không nhất thiết đến đích chính xác",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "walk towards the park. look towards the sky. run towards the exit",
        "example_vi": "đi về phía công viên. nhìn lên bầu trời. chạy về phía lối ra"
    },
    {
        "eng": "through",
        "vi": "xuyên qua",
        "mean": "được dùng khi di chuyển xuyên qua một vật, không gian, hoặc khoảng trống.",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "go through the tunnel. see through the window. walk through the forest",
        "example_vi": "đi qua đường hầm. nhìn qua cửa sổ. đi xuyên qua rừng"
    },
    {
        "eng": "across",
        "vi": "qua, ngang qua",
        "mean": "chỉ sự di chuyển từ một bên sang bên kia của một nơi hoặc một không gian rộng",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "walk across the street. a bridge across the river. swim across the lake",
        "example_vi": "băng qua đường. cây cầu bắc qua sông. bơi qua hồ"
    },
    {
        "eng": "along",
        "vi": "dọc theo",
        "mean": "chỉ sự di chuyển dọc theo chiều dài của một cái gì đó, như con đường hoặc bờ sông.",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "walk along the beach. drive along the highway. run along the river",
        "example_vi": "đi dọc theo bãi biển. lái xe dọc theo đường cao tốc. chạy dọc theo con sông"
    },
    {
        "eng": "around",
        "vi": "quanh, xung quanh",
        "mean": "diễn tả sự di chuyển vòng quanh một vật hoặc trong một khu vực xung quanh.",
        "type": "giới từ chỉ phương hướng và chuyển động",
        "example_eng": "walk around the park. look around the room. travel around the world",
        "example_vi": "đi dạo quanh công viên. nhìn quanh phòng. du lịch vòng quanh thế giới"
    },
    {
        "eng": "without",
        "vi": "không có",
        "mean": "diễn tả trạng thái thiếu vắng hoặc không có một vật, người, hoặc điều gì đó.",
        "type": "các giới từ khác thường gặp",
        "example_eng": "without money. go without food. a house without a roof",
        "example_vi": "không có tiền. sống mà không có thức ăn. một ngôi nhà không có mái"
    },
    {
        "eng": "per",
        "vi": "mỗi, cho mỗi",
        "mean": "được sử dụng để chỉ một tỷ lệ hoặc tỷ số, thường đứng trước một đơn vị đo lường.",
        "type": "các giới từ khác thường gặp",
        "example_eng": "miles per hour. costs $5 per ticket. events per year",
        "example_vi": "dặm mỗi giờ. giá vé là 5 đô la mỗi vé. số sự kiện mỗi năm"
    },
    {
        "eng": "except",
        "vi": "ngoại trừ",
        "mean": "dùng để chỉ ra sự loại trừ hoặc không bao gồm một cái gì đó trong một nhóm hoặc tình huống.",
        "type": "các giới từ khác thường gặp",
        "example_eng": "everyone except John. open every day except Sunday. I like all fruits except bananas",
        "example_vi": "tất cả mọi người ngoại trừ John. mở cửa mỗi ngày ngoại trừ Chủ nhật. tôi thích tất cả các loại trái cây ngoại trừ chuối"
    },
    {
        "eng": "despite, in spite of",
        "vi": "mặc dù",
        "mean": "Despite và In spite of đều chỉ ra rằng một điều gì đó xảy ra mặc dù có sự cản trở, khó khăn, hoặc điều kiện không thuận lợi.",
        "type": "các giới từ khác thường gặp",
        "example_eng": "despite the rain. in spite of his age. they continued working despite the challenges",
        "example_vi": "mặc dù trời mưa. mặc dù tuổi tác của anh ấy. họ tiếp tục làm việc mặc dù gặp khó khăn"
    },
    {
        "eng": "according to",
        "vi": "theo như, theo",
        "mean": "được sử dụng để chỉ nguồn gốc thông tin hoặc ý kiến, cho biết rằng điều gì đó là dựa trên một nguồn cụ thể.",
        "type": "các giới từ khác thường gặp",
        "example_eng": "according to the news. according to my teacher. according to the report",
        "example_vi": "theo như tin tức. theo lời giáo viên của tôi. theo báo cáo"
    }
]
